{
    "homepage": "http://minecraft.curseforge.com/projects/ender-utilities",
    "promos": {
        "1.12.2-latest":        "0.7.7",
        "1.12.2-recommended":   "0.7.7",
        "1.12.1-latest":        "0.7.6",
        "1.12.1-recommended":   "0.7.6",
        "1.12-latest":          "0.7.6",
        "1.12-recommended":     "0.7.6",
        "1.11.2-latest":        "0.7.2",
        "1.11.2-recommended":   "0.7.2",
        "1.10.2-latest":        "0.7.4",
        "1.10.2-recommended":   "0.7.4",
        "1.9.4-latest":         "0.6.5",
        "1.9.4-recommended":    "0.6.5",
        "1.9-latest":           "0.6.1",
        "1.9-recommended":      "0.6.1",
        "1.8.9-latest":         "0.5.6",
        "1.8.9-recommended":    "0.5.6"
    },
    "1.12.2": {
        "0.7.7": "Fix a crash with item pickups due to a Forge change\nAdd a void upgrade to the Barrel",
        "0.7.6": "Fix a crash with the camouflage block models when breaking camouflaged blocks with certain camo blocks/models",
        "0.7.5": "Added a redstone mode option to the Drawbridges",
        "0.7.4": "Added top-half Ender Elevator slabs & layers\nImproved the camouflage model stuff, it should now work with more blocks\nA few small bugfixes"
    },
    "1.12.1": {
        "0.7.6": "Fix a crash with the camouflage block models when breaking camouflaged blocks with certain camo blocks/models",
        "0.7.5": "Added a redstone mode option to the Drawbridges",
        "0.7.4": "Added top-half Ender Elevator slabs & layers\nImproved the camouflage model stuff, it should now work with more blocks\nA few small bugfixes"
    },
    "1.12": {
        "0.7.6": "Fix a crash with the camouflage block models when breaking camouflaged blocks with certain camo blocks/models",
        "0.7.5": "Added a redstone mode option to the Drawbridges",
        "0.7.4": "Added top-half Ender Elevator slabs & layers\nImproved the camouflage model stuff, it should now work with more blocks\nA few small bugfixes",
        "0.7.3": "Fix a possible crash with the Inserter and Portal Panel highlight boxes\nNullifier: Allow in items with NBT (like C&B bits), and improve the model (it can now render C&B bits for example)\nNullifier: Add Ctrl + middle clicking to empty/void slots\nInventory Swapper: Don't cycle/change card to empty slots using the hotkeys",
        "0.7.2": "Change destroying blocks without spilling contents, again. Fixes some crashes with other modded TileEntities.\nPossibly fix/prevent rare rendering/model related crashes\nFix the Nullifier model crashing with recent Forge versions\nFix the Inserter trying to get the target inventory on the wrong side\nFix Placement Properties syncing to clients not working when joining a server",
        "0.7.1": "Updated for Forge 2373+\nSmall possible compatibility improvement to TileEntity creation from NBT (Dolly, Builder's Wand, Drawbridge etc.)\nFix the Ender Tools' harvest level being 0 due to recent item registration changes\nFix item tooltips not rendering in the Ender Infuser and Tool Workstation GUIs\nFix the Dolly's 3rd person model transformations\nLMM: Update a relative rotation upon release\nVarious internal clean-up and changes (removed all SideOnly annotations for example)",
        "0.7.0": "Ported to Minecraft 1.12\nSome internal changes due to 1.12 and Forge changes"
    },
    "1.11.2": {
        "0.7.2": "Change destroying blocks without spilling contents, again. Fixes some crashes with other modded TileEntities.\nPossibly fix/prevent rare rendering/model related crashes",
        "0.7.1": "Added some missing TileEntity ID conversions if updating from 1.10.2\nAdded middle clicking in the player inventory in many of the mod GUIs in creative mode to get a full stack to the cursor, like in vanilla\nPossibly fixed an inventory dupe with the Dolly, Drawbridge and the builder's wand\nPlus a few small bug fixes",
        "0.7.0": "Ported to Minecraft 1.11.2\nMore or less feature parity with 0.7.2 from 1.10.2, with some small improvements/additions"
    },
    "1.10.2": {
        "0.6.5": "Ported the 0.6.5 release from MC 1.9.4 to 1.10.2",
        "0.6.6": "Countless small improvements and bug fixes\nAdded some new modes to the Wand of the Lazy Builder\nAdded Paralyzer and Stimulant Syringes",
        "0.6.7": "Fix a crash when trying to get a build item in the Wand of the Lazy Builder\nFix a crash with the Ender Elevator rotation methods",
        "0.7.0": "Added several new blocks and items, check the full changelog on the CurseForge files page",
        "0.7.1": "Several bugfixes\nSome improvements to the Drawbridge\nAdded camouflage ability to the Drawbridge, Elevators and Portal Frames",
        "0.7.2": "Several bugfixes\nIncreased the maximum number of slots in the ASU to 27",
        "0.7.3": "Added middle clicking in the player inventory in many of the mod GUIs in creative mode to get a full stack to the cursor, like in vanilla\nPossibly fixed an inventory dupe with the Dolly, Drawbridge and the builder's wand\nPlus a few small bug fixes",
        "0.7.4": "Change destroying blocks without spilling contents, again. Fixes some crashes with other modded TileEntities.\nPossibly fix/prevent rare rendering/model related crashes"
    },
    "1.9.4": {
        "0.6.5": "Lots of changes/fixes, see the full changelog on the CurseForge files page",
        "0.6.4": "Disabled the potion shift inside my GUIs\nHandy Bag: Fixed the pickup-matching mode also looking inside the locked bag sections for matches\nHandy Bag & Creation Station: Fixed slow and derpy mass crafting of items\nHandy Chest & Creation Station: Ignore hotbar when moving matching items to chest\nEnder Pearls: Some tweaks and minor fixes\nHandy Chest: Fix an inventory init issue, that should't happen in normal game-play\nEnder Elevator: Fix a derp with the redstone state checking\nLiving Matter Manipulator: Added special case support for Shulkers\nCreation Station: Add cleaning up the crafting grid of left-over items after crafting - allows proper mass-crafting of things like Cake now\nBuilder's Wand: Changed the template file names to include the player name who first used the wand in the Copy mode\nBuilder's Wand: Added a toggle for advancing the position after placing the blocks, added some error messages to chat, and don't render the HUD if the chat is open\nHandy Bag & Item Pickup Manager: Check for and ignore stacks with size 0",
        "0.6.3": "Fix Handy Chest/Creation Station not storing items on Private mode Memory Cards\nAdd toggling item type Memory Card Public/Private mode by right clicking\nFix Ender Bag not showing capacitor charge in Ender Chest mode\nFix Portal activation logic was partially broken in 0.6.2\nHandy Bag: Changed 'Move mathing items to bag' to exclude hotbar by default\nHandy Bag: Changed the block-quick-actions state to be stored per Memory Card\nFix Ender Tools not requiring an Ender Core module when combined with Handy Bag item pickup\nBuilder'sa Wand: Removed block updates from Paste mode (pasting floating blocks is now possible)\nBuilder's Wand: change the mirroring, rotation and corners to be per-mode and per-template/area in Copy, Paste and Delete modes\nBuilder's Wand: Add Copy and Delete mode second position adjustment by shift + scrolling\nBuilder's Wand: Added an option to also delete entities in the Delete mode (creative-only)\nPortal: Added config options to set the portal activation block search limits, plus increased the defaults\nPortal Panel: Fixed a case where the selection box wouldn't update\nAdded a new extra-large variant of the Handy Chest\nRefactored all hotkey/keybind things - scroll wheel doesn't pretend to be the Toggle key anymore, and in some cases they now do separate things\nAdded the ability to rename any items in the Tool Workstation\nAdded the ability to directly rename the Link Crystals in the Portal Panel GUI\nPortal: Added a check to prevent repeated teleporting in some cases\nImproved a few tooltips",
        "0.6.2": "Fix a crash with the Portal Panel and running particles(!!)\nTweak the Portal Panel internal logic - multiple panels on one portal should work better now\nChange several recipes, generally making things cheaper",
        "0.6.1": "Add a chat message/warning if the Portal Scaler doesn't have enough charge for the teleport\nFix Portal Panel dropping with incorrect metadata\nAdd individual selection bounds and thus also proper detection for the Portal Panel buttons\nAdd new item: Cheaty Water Wand and a second variant of it, Super Cheaty Water Wand",
        "0.6.0": "Ported the 0.6.0 release from MC 1.9 to MC 1.9.4.\nFixed some small rendering bugs.\nFixed a Mob Harness crash and another glitch."
    },
    "1.9": {
        "0.6.1": "Fix a crash and another glitch with the Mob Harness\nFix a localization derp with the Ruler\nMinor fixes to Portal Panel text rendering",
        "0.6.0": "Too many changes to list here - check the full changelog on the CurseForge file page.",
        "0.5.3": "Added sorting functionality/buttons to Handy Bag and Handy Chest",
        "0.5.2": "Added a Quick Stacker item\nAdded Off hand slot support to the Inventory Swapper\nRe-enabled the scaled stack size text rendering now that MCP has been fixed\nReduced the Ender Crystal spawn explosion strength\nAdded new chest models and textures\nFixed Ender Dragon boss bar got stuck when teleporting away from The End dimension\nAdded JEI recipe category crafting item support\nAdded support for the Forge update checker",
        "0.5.1": "Fix a couple of BlockState derps, which caused a crash with Optifine installed",
        "0.5.0": "Port the 1.8.9-0.5.3 version to Minecraft 1.9\nChanged various things to work with new 1.9 stuff like the dual wielding/off-hand stuff\nAdded some 1.9 sounds"
    },
    "1.8.9": {
        "0.5.6": "Fix couldn't take items from the Ender Furnace output slot (and possibly some others) except via shift-clicking",
        "0.5.5": "Fix Ender Tool recipes being mixed up\nFix a one block offset in negative coordinates when binding items using the Alt + Shift + Toggle key combo to include rotation",
        "0.5.4": "Handy Bag: Fix an item loss bug on item pickup if the Handy Bag GUI is open\nFix required minimum Forge version\nFix/clean up some BlockState things\nAdd support for the Forge update checker\nAdd new chest models and textures",
        "0.5.3": "Fixed a few Container/slotClick bugs\nFixed a nasty bug in the Ender Hoe crop planting code - it destroyed items from the inventory it was accessing\nFixed Ender Tools right click block place code not removing the stack when the size reaches 0\nFixed an item validity check in the Memory Chest, which resulted in losing the item in the cursor, when trying to manually swap stacks of different items, when there was a locked slot with free space for the item that was held in the cursor\nFixed Ender Bucket not applying the fluid color to the model\nChanged the logic behind opening the Handy Bag. Now it shouldn't open \"on its own\" for example when browsing recipies in JEI if the originally opened inventory was the regular player inventory instead of the Handy Bag.\nChanged the \"Move all items (FROM the player inventory)\" functionality to ignore the hotbar. In the Handy Bag GUI, you can still move everything, including the hotbar, by holding shift when clicking the button.",
        "0.5.2": "Fix Handy Bag GUI buttons and slot backgrounds etc. being messed up with potion effects active\nA couple of minor clean-ups/fixes to inventory/container things",
        "0.5.1": "Fixed many item and block models being broken inside some of my inventory GUIs (the ones with scaled stack size rendering)\nFixed some recipies being wrong or missing in 0.5.0 (due to me being a derp and forgetting them while reorganizing some of the blocks...)\nFixed Ender Bow arrow requirement with some other mods (removed unnecessary events)\nUpdated JEI recipe area support for multiple areas in Creation Station\nChanged all inventories from the old crappy IInventory into IItemHandler, and for TileEntities also into using capabilities with it\nThanks to IItemHandler, things like the Handy Chest are now accessible externally, for example by hoppers\nThe Ender Furnace also once again has support for large stacks, thanks to IItemHandler\nVarious small inventory/GUI related improvements and fixes, like shift + clicking target slot priorities etc.\nSome miscellaneous small bug fixes\nKnown issues: shift + double clicking to move all matching items doesn't work properly because vanilla code doesn't understand SlotItemHandler type slots",
        "0.5.0": "Update to Minecraft 1.8.9\nAdd JEI support to Creation Station\nAdd mod config gui factory (ie. main menu config screen support)\nRe-organized some of the blocks\nSome miscellaneous bug fixes"
    }
}
